#+STARTUP: content
#+DESCRIPTION: Minimalistic emacs.
#+PROPERTY: header-args :results silent

#+TITLE: Emacs config for minimalist.

** Profiler
#+BEGIN_SRC emacs-lisp
(use-package explain-pause-mode
  :ensure (explain-pause-mode :type git :host github :repo "lastquestion/explain-pause-mode")
  :defer t)
#+END_SRC

#+RESULTS:
: [nil 26403 44225 767779 nil elpaca-process-queues nil nil 0 nil]


*** Treesit core
# Right not its not supporteed well. Moreover, tree-sitter-hl-mode is really better then built in functionality
#+BEGIN_SRC emacs-lisp 
(use-package treesit
  :ensure nil
  :hook
  (go-ts-mode . (lambda () (setq-local tab-width 2)))
  :custom
  (go-ts-mode-indent-offset 2)
  :config
  (setq treesit-language-source-alist
        '((go "https://github.com/tree-sitter/tree-sitter-go")
          (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
          (scss "https://github.com/serenadeai/tree-sitter-scss")))
  (setq treesit-font-lock-level 4))
#+END_SRC

#+RESULTS:
: [nil 26192 58130 222559 nil elpaca-process-queues nil nil 999999 nil]

*** Treesit fold. Core package
#+BEGIN_SRC emacs-lisp :noweb yes
(use-package treesit-fold
  :ensure (treesit-fold :type git :host github :repo "abougouffa/treesit-fold")
  :hook ((web-mode
          ng2-html-mode
          ng2-ts-mode
          typescript-mode
          js-mode
          js-ts-mode
          python-ts-mode
          python-mode
          html-mode
          json-mode
          json-ts-mode
          go-mode
          bash-mode
          css-mode
          scss-mode
          go-ts-mode
          typescript-ts-mode) . @treesit-fold-init)
  :config
  (add-to-list 'treesit-fold-range-alist '(ng2-ts-mode . ((export_clause . ts-fold-range-seq)
                                                          (statement_block . treesit-fold-range-seq)
                                                          (comment . treesit-fold-range-c-like-comment))) t)

  (add-to-list 'treesit-fold-range-alist '(web-mode . (html-mode
                                                       (element . treesit-fold-range-html)
                                                       (comment treesit-fold-range-seq 1 -1))))

  (add-to-list 'treesit-fold-range-alist '(ng2-html-mode . (html-mode
                                                            (element . treesit-fold-range-html)
                                                            (comment treesit-fold-range-seq 1 -1))))
  (add-to-list 'treesit-fold-range-alist '(scss-mode . ((keyframe_block_list . ts-fold-range-seq)
                                                        (block . treesit-fold-range-seq)
                                                        (comment . treesit-fold-range-c-like-comment))) t)


  (add-to-list 'treesit-fold-range-alist '(typescript-ts-mode . ((export_clause . ts-fold-range-seq)
                                                                 (statement_block . treesit-fold-range-seq)
                                                                 (comment . treesit-fold-range-c-like-comment))))

  (add-to-list 'treesit-fold-range-alist `(typescript-ts-mode . ,(treesit-fold-parsers-typescript)))
  (add-to-list 'treesit-fold-range-alist `(go-ts-mode . ,(treesit-fold-parsers-go)))
  ;; (add-to-list 'treesit-fold-range-alist '(go-ts-mode . ts-fold-summary-go))

  ;; TODO: DOESN'T WORK for scss, needs another rules (check it later for custom pareser)
  (add-to-list 'treesit-fold-range-alist '(scss-mode . (css-mode
                                                        (keyframe_block_list . treesit-fold-range-seq)
                                                        (block . treesit-fold-range-seq)
                                                        (comment . treesit-fold-range-c-like-comment)))))


;; TODO: check changes for correct mode cast
;; (add-to-list 'treesit-fold-foldable-node-alist '(ng2-ts-mode comment statement_block export_clause))
;; (add-to-list 'treesit-fold-foldable-node-alist '(web-mode comment element))
;; (add-to-list 'treesit-fold-foldable-node-alist '(scss-mode comment block keyframe_block_list))
;; (add-to-list 'treesit-fold-foldable-node-alist '(ng2-html-mode comment element)))
#+END_SRC

#+RESULTS:
: [nil 26300 26309 151386 nil elpaca-process-queues nil nil 999999 nil]
*** Corfu package
#+BEGIN_SRC emacs-lisp
(use-package corfu
  :defer 2
  :custom
  (corfu-auto t)
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-commit-predicate nil)   ;; Do not commit selected candidates on next input
  (corfu-quit-at-boundary t)     ;; Automatically quit at word boundary
  (corfu-quit-no-match t)        ;; Automatically quit if there is no match
  (corfu-auto-delay 0.1)
  (corfu-echo-documentation t) ;; Do not show documentation in the echo area
  (corfu-preselect-first nil)
  (corfu-auto-prefix 2)
  (corfu-separator ?\s) 
  ;; Optionally use TAB for cycling, default is `corfu-complete'.
  :bind
  (("C-x C-o" . completion-at-point)
   ("C-SPC" . completion-at-point)
   :map corfu-map
   ("TAB" . corfu-next)
   ([tab] . corfu-next)
   ("C-j" . corfu-next)
   ("C-k" . corfu-previous)
   ("S-TAB" . corfu-previous)
   ("<return>" . corfu-insert)
   ("RET" . corfu-insert)
   ("C-<return>" . corfu-insert-seporator)
   ([backtab] . corfu-previous))
  :config
  ;; (add-hook 'meow-normal-mode-hook (lambda () (corfu-quit) (message "quite")))
  (add-hook 'meow-insert-exit-hook (lambda () (corfu-quit)))
  (setq lsp-completion-provider :none)

  (global-corfu-mode))
#+END_SRC

#+RESULTS:
: [nil 26179 25948 143251 nil elpaca-process-queues nil nil 999999 nil]

*** Open vterm for current buffer
#+BEGIN_SRC emacs-lisp 
(defun @vterm-change-current-directory-to-active-buffer-pwd ()
  "Just exec CD to pwd of active buffer."
  (interactive)
  (when-let* ((file-name (buffer-file-name))
              (file-dir (file-name-directory file-name))
              (file-dir (replace-regexp-in-string " " "\\\\\  " file-dir)))
    ;; (save-window-excursion
      (vterm-toggle-show)
      (switch-to-first-matching-buffer "vterm")
      (vterm-send-C-c)
      (vterm-send-string (concat "cd " file-dir))
      (vterm-send-return)
      ;; )
    ))
#+END_SRC

#+RESULTS:
: @vterm-change-current-directory-to-active-buffer-pwd

*** Keybindings
#+BEGIN_SRC emacs-lisp
(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
  (meow-leader-define-key
   ;; C-c C-j C-/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use C-c C-`C-0-9 for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("?" . meow-keypad-describe-key))
  (meow-normal-define-key
   '("*" . (lambda () (interactive)
             (call-interactively 'meow-mark-symbol)
             (call-interactively 'meow-search)
             
             ))
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("s-o" . meow-last-buffer)
   '("ge" . end-of-buffer)
   '("gg" . beginning-of-buffer)
   '("6" . meow-expand-6)
   '("@" . meow-end-or-call-kmacro)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '("$" . @meow-select-till-eol)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("s-d" . meow-inner-of-thing)
   '("s-D" . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("i" . meow-append)
   '("o" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("F" . meow-find)
   '("f" . avy-goto-word-1)
   '("q" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("a" . meow-insert)
   '("O" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("/" . meow-block)
   '("?" . meow-to-block)
   '("P" . meow-yank)
   '("C" . @meow-change-till-eol)
   '("p" . @meow-yank-below)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   '("T" . @meow-backward-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("V" . meow-visual-line)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("Q" . meow-pop-selection)
   '("'" . repeat)
   '("=" . indent-for-tab-command)
   '(":" . query-replace-regexp)
   '("A" . @edit-after-eol)
   '("I" . @edit-before-bol)
   '("<escape>" . ignore))

  (meow-define-keys 'motion
    '("\\n" . meow-normal-mode)
    '("[" . meow-beginning-of-thing)
    '("]" . meow-end-of-thing)
    '("\\q" . kill-current-buffer))

  (meow-define-keys 'insert
   '("s-o" . meow-last-buffer)
   '("s-p" . xah-paste-from-register-1))


  (meow-define-keys 'normal
    '("\\q" . kill-current-buffer)
    '("z z" . recenter)
    '("g c" . comment-or-uncomment-region)))

(defun @meow-thing-register ()
  (meow-thing-register 'whitespace '(regexp " \\|\n" " \\|\n") '(regexp " \\|\n" " \\|\n"))
  (add-to-list 'meow-char-thing-table '(?w . whitespace))

  ;; (meow-thing-register 'between-space '(regexp "[^[[:blank:]]]" "[^[[:blank:]]]") '(regexp "[^[[:blank:]]]" "[^[[:blank:]]]"))
  ;; (add-to-list 'meow-char-thing-table '(?e . between-space))

  (meow-thing-register 'non-whitespace
                         '(syntax . "-")
                         '(syntax . "-"))
  (add-to-list 'meow-char-thing-table '(?e . non-whitespace))

  (add-to-list 'meow-char-thing-table '(?\" . quoted))
  (add-to-list 'meow-char-thing-table '(?' . quoted))
  (add-to-list 'meow-char-thing-table '(?< . angle))

  (add-to-list 'meow-char-thing-table '(?( . round))
  (add-to-list 'meow-char-thing-table '(?) . round))

  (add-to-list 'meow-char-thing-table '(?{ . curly))
  (add-to-list 'meow-char-thing-table '(?} . curly))
  
  (add-to-list 'meow-char-thing-table '(?[ . square))
  (add-to-list 'meow-char-thing-table '(?] . square))

  (meow-thing-register 'quoted
                       '(regexp "\"\\|'\\|`" "\"\\|'\\|`")
                       '(regexp "\"\\|'\\|`" "\"\\|'\\|`"))

  (meow-thing-register 'angle
                       '(regexp "<" ">")
                       '(regexp "<" ">")))

 #+END_SRC

 #+RESULTS:
 : @meow-thing-register

*** LSP-mode Core package
#+BEGIN_SRC emacs-lisp
(setq lsp-keymap-prefix "s-9")
(use-package lsp-mode
  ;; :ensure (:host github :repo "emacs-lsp/lsp-mode" :rev "8c57bcfa4b0cf9187011425cf276aed006f27df4")
  :after (flycheck)
  :hook
  ((clojure-mode
    scss-mode
    go-mode
    css-mode
    js-mode
    typescript-mode
    vue-mode
    web-mode
    html-mode
    ng2-ts-mode
    python-mode
    dart-mode
    typescript-tsx-mode

    ;; Treesit
    html-ts-mode
    typescript-ts-mode
    go-ts-mode
    js-ts-mode
    bash-ts-mode
    tsx-ts-mode) . lsp-deferred)
  (web-mode . lsp-deferred)
  (lsp-completion-mode . my/lsp-mode-setup-completion)
  :bind
  (("C-c f n" . flycheck-next-error)
   ("C-c l a" . lsp-execute-code-action)
   ("C-c i m" . lsp-ui-imenu)
   ("C-c l d" . lsp-workspace-folders-remove)
   ("C-c l t" . lsp-find-type-definition)
   ("C-c l f" . lsp-find-references)
   ("C-c l i" . lsp-find-implementation)
   ("C-c l w" . lsp-workspace-restart)
   ("C-c r l" . lsp)
   ("C-c l a" . lsp-execute-code-action)
   ("C-c l r" . lsp-rename)
   :map meow-normal-state-keymap
   ("\\l" . lsp-execute-code-action))
  :bind-keymap
  ("s-9" . lsp-command-map)
  :init
  (define-key lsp-mode-map (kbd "s-9") lsp-command-map)
  (setq lsp-keymap-prefix "s-9")

  (setq lsp-headerline-breadcrumb-enable nil)
  ;; Configuration for corfu
  ;; https://github.com/minad/corfu/wiki#configuring-corfu-for-lsp-mode
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(flex))) ;; Configure flex
  :custom
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-idle-delay 0.3)
  (lsp-completion-provider :capf)
  (lsp-enable-on-type-formatting nil)
  (lsp-eldoc-render-all nil)
  (lsp-prefer-flymake nil)
  (lsp-modeline-diagnostics-scope :workspace)
  (lsp-enable-indentation nil)
  (lsp-enable-on-type-formatting nil)
  (lsp-apply-edits-after-file-operations nil)
  ;; (lsp-clients-typescript-server-args '("--stdio" "--tsserver-log-file" "/dev/stderr"))
  (lsp-clients-typescript-server-args '("--stdio"))
  (lsp-completion-default-behaviour :insert)
  (lsp-yaml-schemas '((kubernetes . ["/auth-reader.yaml", "/deployment.yaml"])))
  (lsp-disabled-clients '(html-ls))
  (setq lsp-pyright-venv-path (concat (getenv "HOME") "/.virtualenvs"))
  ;; (lsp-completion-provider :none)
  ;; (lsp-completion-provider :capf)
  ;; Disable bottom help info
  (lsp-signature-render-documentation nil)
  (lsp-signature-auto-activate nil)
  (lsp-enable-snippet nil)
  ;; (lsp-use-plists t)
  (lsp-enable-file-watchers t)
  (lsp-file-watch-threshold 8000)
  :config
  (setq lsp-auto-execute-action nil)
  (setq lsp-javascript-display-return-type-hints t)
  (setq lsp-json-schemas
        `[
          (:fileMatch ["ng-openapi-gen.json"] :url "https://raw.githubusercontent.com/cyclosproject/ng-openapi-gen/master/ng-openapi-gen-schema.json")
          (:fileMatch ["package.json"] :url "https://raw.githubusercontent.com/SchemaStore/schemastore/master/src/schemas/json/package.json")
          ])
  (set-face-attribute 'lsp-face-highlight-read nil :foreground "#61AFEF" :bold t :underline nil)
  ;; Eslint
  (setq lsp-eslint-download-url "https://marketplace.visualstudio.com/_apis/public/gallery/publishers/dbaeumer/vsextensions/vscode-eslint/3.0.10/vspackage") ;; latest VSCode eslint extension from marketplace
  (setq lsp-eslint-server-command `("node"
                                    "/Users/darkawower/.vscode/extensions/dbaeumer.vscode-eslint-3.0.10/server/out/eslintServer.js"
                                    "--stdio"))
  ;; Flycheck patch checkers
  (require 'flycheck)
  (require 'lsp-diagnostics)
  (lsp-diagnostics-flycheck-enable)
  (mapc #'lsp-flycheck-add-mode '(typescript-mode js-mode css-mode vue-html-mode))
  ;; Golang
  (defun lsp-go-install-save-hooks ()
    (flycheck-add-next-checker 'lsp '(warning . go-gofmt) 'append)
    (flycheck-add-next-checker 'lsp '(warning . go-golint))
    (flycheck-add-next-checker 'lsp '(warning . go-errcheck))
    (flycheck-add-next-checker 'lsp '(warning . go-staticcheck))

    ;; (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))

  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)

  (setq lsp-enable-symbol-highlighting t
        lsp-enable-snippet nil  ;; Not supported by company capf, which is the recommended company backend
        lsp-pyls-plugins-flake8-enabled nil)
  (set-face-foreground 'lsp-face-highlight-read @m-color-secondary)
  (set-face-foreground 'lsp-face-highlight-textual @m-color-secondary)

  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.bun\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.npm\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.pnpm-store\\'")
  (add-to-list 'lsp-file-watch-ignored "[/\\\\]\\venv\\'")
  (add-to-list 'lsp-file-watch-ignored "[/\\\\]\\pyenv\\'")
  (add-to-list 'lsp-file-watch-ignored "[/\\\\]\\.cache\\'")
  (set-face-attribute 'lsp-face-highlight-textual nil :background "#c0caf5")
  ;; Install corfu completion for lsp
  ;; (defun corfu-lsp-setup ()
  ;; (setq-local completion-styles '(orderless basic)
  ;;             completion-category-defaults nil))
  ;; (add-hook 'lsp-mode-hook #'corfu-lsp-setup)
  (@setup-compilation-errors)
  (setq lsp-disabled-clients '(html-ls))
  (setq lsp-eldoc-hook nil))
#+END_SRC

#+RESULTS:
: [nil 26300 53253 712612 nil elpaca-process-queues nil nil 999999 nil]

*** LSP UI
#+BEGIN_SRC emacs-lisp 
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :after lsp-mode
  :bind (:map meow-normal-state-keymap
         ("\\h" . lsp-ui-doc-toggle)
         :map lsp-ui-peek-mode-map
         ("C-j" . lsp-ui-peek--select-next)
         ("C-k" . lsp-ui-peek--select-prev))
  :config
  (setq lsp-ui-sideline-diagnostic-max-line-length 100
        lsp-ui-sideline-diagnostic-max-lines 8
        lsp-ui-doc-delay 1
        lsp-ui-doc-position 'top
        lsp-ui-doc-show-with-mouse nil
        lsp-ui-doc-border @m-color-main))
#+END_SRC

#+RESULTS:
: [nil 26179 5312 822990 nil elpaca-process-queues nil nil 999999 nil]

*** Main mode
#+BEGIN_SRC emacs-lisp
(use-package elisp-mode
  :defer t
  :ensure nil
  :hook ((emacs-lisp-mode . paren-face-mode)
         (emacs-lisp-mode . (lambda () (setq fill-column 80))))

  :bind (("C-c o c" . outline-cycle)
         ("C-c o a" . outline-show-all)
         ("C-c o m" . outline-hide-body)
         ("C-c o ]" . outline-next-heading)
         ("C-c o [" . outline-previous-heading)
         ("C-c o c" . counsel-outline)
         ("C-c o e" . outline-hide-entry)
         ("C-c o n" . outline-toggle-children)
         ("C-c o b" . outline-cycle-buffer)
         ;; TODO: eval buffer or region
         ("C-c C-c e" . eval-buffer))

  :config
  (add-hook 'emacs-lisp-mode-hook (lambda () (setq rainbow-delimiters-mode -1))))

(use-package package-build
  :defer t)

(use-package package-lint

  :defer t)

#+END_SRC

#+RESULTS:
: [nil 26306 16651 670287 nil elpaca-process-queues nil nil 999999 nil]
** Copilot
#+BEGIN_SRC emacs-lisp
(use-package copilot
  :defer 5
  :ensure (copilot :host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  :hook
  (prog-mode . copilot-mode)
  (text-mode . copilot-mode)
  :bind
  (("s-]" . copilot-next-completion)
   ("s-[" . copilot-previous-completion)
   ("s-l" . copilot-accept-completion)
   ("s-k" . copilot-accept-completion)
   ("s-j" . copilot-complete)
   ("s-;" . copilot-accept-completion-by-word)
   ("s-/" . copilot-accept-completion-by-line))
  :custom
  (copilot-idle-delay 0.3)
  :config
  (setq copilot--previous-point nil)
  (setq copilot--previous-window-width nil)
  (global-set-key (kbd "s-l") 'copilot-accept-completion)
  (copilot-diagnose)
  ;; (global-copilot-mode)
  (add-hook 'meow-insert-enter-hook (lambda ()
                                      (setq blamer--block-render-p t)
                                      (blamer--clear-overlay)))
  (add-hook 'meow-insert-exit-hook (lambda ()
                                     (setq blamer--block-render-p nil)
                                     (copilot-clear-overlay)))
  )

#+END_SRC

#+RESULTS:
: [nil 26300 51638 753524 nil elpaca-process-queues nil nil 999999 nil]

*** Switch to scratch buffer
#+BEGIN_SRC emacs-lisp 
(defun @switch-to-scratch ()
  "Switch to scratch buffer"
  (interactive)
  ;; (persistent-scratch-autosave-mode -1)
  (let* ((buffer-name "*quicknote*")
         (buffer (get-buffer buffer-name)))

    (unless buffer
      (persistent-scratch-setup-default)
      (setq buffer (get-buffer-create buffer-name))
      (persistent-scratch-restore))
    
    (message "current buffer: %s" buffer)
    (with-current-buffer buffer
      (pop-to-buffer buffer)
      ;; (when (equal (s-trim (buffer-substring-no-properties (point-min) (point-max))) "")
      ;;   (message "Persistent scratch restored")
      ;;   (persistent-scratch-setup-default))
      ;; (goto-char (point-max))
      ;; (unless (eq major-mode 'org-mode)
      ;;   (org-mode))
      (org-mode)
      (meow-insert))))
#+END_SRC

#+RESULTS:
: @switch-to-scratch

*** Persistent scratch
Init file for storing persistent scratches
#+BEGIN_SRC emacs-lisp
(defun create-persistent-scratch-file-if-not-exist ()
  "Create the persistent-scratch file if it does not already exist."
  (let ((scratch-file (expand-file-name "var/persistent-scratch.el" user-emacs-directory)))
    (unless (file-exists-p scratch-file)
      (make-directory (file-name-directory scratch-file) t)
      (with-temp-file scratch-file
        (insert ";; Persistent scratch file\n")))))

;; Run the function during startup
(create-persistent-scratch-file-if-not-exist)
#+END_SRC

Override function for autosaving
#+BEGIN_SRC emacs-lisp
(defvar @persistent-scratch-last-content nil)

(defun @persistent-scratech-savable-p ()
  "Return non-nil if the current buffer is savable."
  (when-let* ((current-buffer-scratch-p (string= (buffer-name) "*quicknote*"))
              (scratch-buffer (get-buffer "*quicknote*"))
              (scratch-buffer-content (with-current-buffer scratch-buffer
                                        (buffer-string)))
              (scratch-buffer-content-not-empty (not (equal scratch-buffer-content ""))))
    ;; (scratch-buffer-content-changed (not (equal scratch-buffer-content @persistent-scratch-last-content)))
    ;; (scratch-string-not-nil (not (equal scratch-buffer-content "nil"))))

    ;; (setq @persistent-scratch-last-content scratch-buffer-content)
    ;; (message "buffer name %s, buffer content %s, content true? %s"
    ;;          (get-buffer "*quicknote*")
    ;;          (with-current-buffer "*quicknote*"
    ;;            (buffer-string))
    ;;          (with-current-buffer "*quicknote*"
    ;;            (not (equal (buffer-string) ""))))
    t))

(defun @save-scratch-buffer-p ()
  "Return non-nil if the current buffer is the scratch buffer."

  (let ((persistent-scrach-savable-p (@persistent-scratech-savable-p)))
    persistent-scrach-savable-p))

(setq persistent-scratch-scratch-buffer-p-function #'@save-scratch-buffer-p)
#+END_SRC

#+RESULTS:
: @save-scratch-buffer-p

#+BEGIN_SRC emacs-lisp
(defun @preserve-persistent-scratch ()
  "Preserve the persistent scratch buffer. Make backup."
  (interactive)
  (persistent-scratch-save)
  (persistent-scratch-new-backup))
#+END_SRC

#+RESULTS:
: @save-scratch-buffer-p

#+NAME: persistent-scratch-save
#+BEGIN_SRC emacs-lisp :tangle no
(defun persistent-scratch-save (&optional file)
  "Save the current state of scratch buffers.
When FILE is non-nil, the state is saved to FILE; when nil or when called
interactively, the state is saved to `persistent-scratch-save-file'.
What state exactly is saved is determined by `persistent-scratch-what-to-save'.

When FILE is nil and `persistent-scratch-backup-directory' is non-nil, a copy of
`persistent-scratch-save-file' is stored in that directory, with a name
representing the time of the last `persistent-scratch-new-backup' call."
  (interactive)
  (let* ((actual-file (or file persistent-scratch-save-file))
         (tmp-file (concat actual-file ".new"))
         (saved-state (persistent-scratch--save-buffers-state)))
    (when (car saved-state)
      (let ((old-umask (default-file-modes)))
        (set-default-file-modes #o600)
        (unwind-protect
            (let ((coding-system-for-write 'utf-8-unix))
              (write-region (cdr saved-state) nil tmp-file nil 0))
          (set-default-file-modes old-umask)))
      (run-hook-with-args 'persistent-scratch-before-save-commit-functions tmp-file)
      (rename-file tmp-file actual-file t)
      (dolist (buffer (car saved-state))
        (with-current-buffer buffer
          (set-buffer-modified-p nil)))
      (when (called-interactively-p 'interactive)
        (message "Wrote persistent-scratch file %s" actual-file)))
    (unless file
      (persistent-scratch--update-backup)
      (persistent-scratch--cleanup-backups))))
#+END_SRC

Override autosave function. What is the sense save buffer whic doesn't exist??? 

#+BEGIN_SRC emacs-lisp :noweb yes
(use-package persistent-scratch
  :demand t
  :bind (("C-c n n" . @switch-to-scratch))
  :config
  <<persistent-scratch-save>>
  (setq persistent-scratch-backup-directory "~/apps/pure-emacs/backups")
  (persistent-scratch-autosave-mode)
  (setq persistent-scratch-autosave-interval 5))
#+END_SRC


